astb_relise/src/DocumentJournals/ЖурналДокументовПоСотруднику/ЖурналДокументовПоСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ЖурналДокументовПоСотруднику</name>
  <registeredDocuments>Document.ВозвратИзЧистки</registeredDocuments>
  <registeredDocuments>Document.ВозвратСредствЗащитыОтСотрудника</registeredDocuments>
  <registeredDocuments>Document.ВыдачаСредствЗащитыСотруднику</registeredDocuments>
  <registeredDocuments>Document.ОбменСредствЗащитыСотрудника</registeredDocuments>
  <registeredDocuments>Document.КадровоеПеремещение</registeredDocuments>
  <registeredDocuments>Document.ИнструктажСотрудников</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаНаПроизвольнуюВыдачуСИЗ</registeredDocuments>
  <registeredDocuments>Document.ОтсутствиеНаРабочемМесте</registeredDocuments>
  <registeredDocuments>Document.ПередачаВЧистку</registeredDocuments>
  <registeredDocuments>Document.ПриемНаРаботу</registeredDocuments>
  <registeredDocuments>Document.СписаниеСредствЗащитыСотрудника</registeredDocuments>
  <registeredDocuments>Document.Увольнение</registeredDocuments>
  <registeredDocuments>Document.УстановкаУсловийРаботыСотрудника</registeredDocuments>
  <registeredDocuments>Document.УстановкаОсновногоМестаРаботыСотрудника</registeredDocuments>
  <registeredDocuments>Document.УстановкаСоответствийНоменклатурыВыдачи</registeredDocuments>
  <registeredDocuments>Document.ВыдачаСредствЗащитыПоВедомости</registeredDocuments>
  <registeredDocuments>Document.ВыдачаДежурныхСредствЗащиты</registeredDocuments>
  <registeredDocuments>Document.ПродлениеСрокаЭксплуатации</registeredDocuments>
  <registeredDocuments>Document.ПриемСредствЗащитыНаХранение</registeredDocuments>
  <registeredDocuments>Document.ВозвратСредствЗащитыСХранения</registeredDocuments>
  <registeredDocuments>Document.ПеремещениеСредствЗащитыНаХранении</registeredDocuments>
  <columns>
    <name>СоздательДокумента</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
</mdclass:DocumentJournal>

astb_relise/src/Documents/ВозвратИзЧистки/ВозвратИзЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратИзЧистки</name>
  <basedOn>Document.ПередачаВЧистку</basedOn>
  <registerRecords>AccumulationRegister.СредстваЗащитыВЧистке</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПередачаВЧистку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ВозвратСредствЗащитыОтСотрудника/ВозвратСредствЗащитыОтСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратСредствЗащитыОтСотрудника</name>
  <basedOn>Document.СписаниеСредствЗащитыСотрудника</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СписаниеСредствЗащитыСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ВыдачаДежурныхСредствЗащиты/ВыдачаДежурныхСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаДежурныхСредствЗащиты</name>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/DocumentJournals/ЖурналДокументовПоСотруднику/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник",ТекущийСотрудник);
	
	УстановитьОтборПоСотруднику();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСотруднику()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратИзЧисткиТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратИзЧистки.Товары КАК ВозвратИзЧисткиТовары
	|ГДЕ
	|	ВозвратИзЧисткиТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратСредствЗащитыОтСотрудника.Ссылка
	|ИЗ
	|	Документ.ВозвратСредствЗащитыОтСотрудника КАК ВозвратСредствЗащитыОтСотрудника
	|ГДЕ
	|	ВозвратСредствЗащитыОтСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаДежурныхСредствЗащиты.Ссылка
	|ИЗ
	|	Документ.ВыдачаДежурныхСредствЗащиты КАК ВыдачаДежурныхСредствЗащиты
	|ГДЕ
	|	ВыдачаДежурныхСредствЗащиты.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Ссылка
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыПоВедомости.Товары КАК ВыдачаСредствЗащитыПоВедомостиТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыПоВедомостиТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗ.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаПроизвольнуюВыдачуСИЗ КАК ЗаявкаНаПроизвольнуюВыдачуСИЗ
	|ГДЕ
	|	ЗаявкаНаПроизвольнуюВыдачуСИЗ.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнструктажСотрудникаРаботники.Ссылка
	|ИЗ
	|	Документ.ИнструктажСотрудников.Работники КАК ИнструктажСотрудникаРаботники
	|ГДЕ
	|	ИнструктажСотрудникаРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровоеПеремещениеРаботники.Ссылка
	|ИЗ
	|	Документ.КадровоеПеремещение.Работники КАК КадровоеПеремещениеРаботники
	|ГДЕ
	|	КадровоеПеремещениеРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбменСредствЗащитыСотрудника.Ссылка
	|ИЗ
	|	Документ.ОбменСредствЗащитыСотрудника КАК ОбменСредствЗащитыСотрудника
	|ГДЕ
	|	ОбменСредствЗащитыСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтсутствиеНаРабочемМесте.Ссылка
	|ИЗ
	|	Документ.ОтсутствиеНаРабочемМесте КАК ОтсутствиеНаРабочемМесте
	|ГДЕ
	|	ОтсутствиеНаРабочемМесте.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаВЧисткуТовары.Ссылка
	|ИЗ
	|	Документ.ПередачаВЧистку.Товары КАК ПередачаВЧисткуТовары
	|ГДЕ
	|	ПередачаВЧисткуТовары.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботуРаботники.Ссылка
	|ИЗ
	|	Документ.ПриемНаРаботу.Работники КАК ПриемНаРаботуРаботники
	|ГДЕ
	|	ПриемНаРаботуРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеСредствЗащитыСотрудника.Ссылка
	|ИЗ
	|	Документ.СписаниеСредствЗащитыСотрудника КАК СписаниеСредствЗащитыСотрудника
	|ГДЕ
	|	СписаниеСредствЗащитыСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УвольнениеРаботники.Ссылка
	|ИЗ
	|	Документ.Увольнение.Работники КАК УвольнениеРаботники
	|ГДЕ
	|	УвольнениеРаботники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаСоответствийНоменклатурыВыдачиСоответствия.Ссылка
	|ИЗ
	|	Документ.УстановкаСоответствийНоменклатурыВыдачи.Соответствия КАК УстановкаСоответствийНоменклатурыВыдачиСоответствия
	|ГДЕ
	|	УстановкаСоответствийНоменклатурыВыдачиСоответствия.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаУсловийРаботыСотрудника.Ссылка
	|ИЗ
	|	Документ.УстановкаУсловийРаботыСотрудника КАК УстановкаУсловийРаботыСотрудника
	|ГДЕ
	|	УстановкаУсловийРаботыСотрудника.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратСредствЗащитыСХранения.Ссылка
	|ИЗ
	|	Документ.ВозвратСредствЗащитыСХранения КАК ВозвратСредствЗащитыСХранения
	|ГДЕ
	|	ВозвратСредствЗащитыСХранения.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемСредствЗащитыНаХранение.Ссылка
	|ИЗ
	|	Документ.ПриемСредствЗащитыНаХранение КАК ПриемСредствЗащитыНаХранение
	|ГДЕ
	|	ПриемСредствЗащитыНаХранение.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеСредствЗащитыНаХранении.Ссылка
	|ИЗ
	|	Документ.ПеремещениеСредствЗащитыНаХранении КАК ПеремещениеСредствЗащитыНаХранении
	|ГДЕ
	|	ПеремещениеСредствЗащитыНаХранении.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстановкаОсновногоМестаРаботыСотрудника.Ссылка
	|ИЗ
	|	Документ.УстановкаОсновногоМестаРаботыСотрудника КАК УстановкаОсновногоМестаРаботыСотрудника
	|ГДЕ
	|	УстановкаОсновногоМестаРаботыСотрудника.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник",ТекущийСотрудник);	
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
КонецПроцедуры
